Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: On this machine, run the ``.sh`` file to install the tools. Here is an example for the traditional installer::
it_it: Su questa macchina, si esegue il file ``.sh`` per installare gli strumenti. Ecco un esempio per l'installazione tradizionale::

source: Once :term:`UPSTREAM_STABLE_RELEASE_REGEX` has been accepted for a recipe, version upgrades matching the accepted pattern are considered acceptable by default (with the usual ability to reject if upstream fails to follow their own stable guidelines).
it_it: Una volta che :term:`UPSTREAM_STABLE_RELEASE_REGEX` è stato accettato per una ricetta, gli aggiornamenti di versione che corrispondono al modello accettato sono considerati accettabili per default (con la possibilità di rifiutarli se la versione upstream non segue le proprie linee guida per le versioni stabili).

source: Once a build is completed, you get the status when you use the following call::
it_it: Una volta completata una build, è possibile visualizzarne lo stato utilizzando la seguente chiamata::

source: Once done, you should be able to list your new key with the following command:
it_it: Una volta completata la procedura, si dovrebbe essere in grado di visualizzare la nuova chiave con il seguente comando:

source: Once in that directory, source the build environment script::
it_it: Una volta in tale directory, eseguire lo script dell'ambiente di compilazione::

source: Once on the target, use these steps to create a trace::
it_it: Una volta sul target, seguire questi passaggi per creare una traccia::

source: Once packages are split and stored in the Package Feeds area, the build system uses BitBake to generate the root filesystem image:
it_it: Una volta che i pacchetti sono stati suddivisi e archiviati nell'area Package Feeds, il sistema di build utilizza BitBake per generare l'immagine del filesystem root:

source: Once released, the release enters the stable release process at which time a person is assigned as the maintainer for that stable release. This maintainer monitors activity for the release by investigating and handling nominated patches and backport activity. Only fixes and enhancements that have first been applied on the "master" branch (i.e. the current, in-development branch) are considered for backporting to a stable release.
it_it: Una volta rilasciata, la release entra nel processo di rilascio stabile, momento in cui viene assegnata una persona come responsabile della manutenzione per quella release stabile. Questo responsabile monitora l'attività relativa alla release, esaminando e gestendo le patch proposte e le attività di backport. Solo le correzioni e i miglioramenti che sono stati prima applicati sul branch "master" (ovvero il ramo corrente in fase di sviluppo) vengono presi in considerazione per il backporting in una release stabile.

source: Once source code is downloaded, the build system extracts the sources into a local work area where patches are applied and common steps for configuring and compiling the software are run.
it_it: Una volta scaricato il codice sorgente, il sistema di build estrae i file in un'area di lavoro locale dove vengono applicate le patch ed eseguiti i passaggi comuni per la configurazione e la compilazione del software.

source: Once source code is fetched and unpacked, BitBake locates patch files and applies them to the source files:
it_it: Una volta scaricato ed estratto il codice sorgente, BitBake individua i file di patch e li applica ai file sorgente:

source: Once the ``Stop`` button is pressed, the graphical view magically fills up with a colorful per-CPU display of the trace data, along with the detailed event listing below that:
it_it: Una volta premuto il pulsante ``Stop``, la visualizzazione grafica si riempie magicamente con una rappresentazione a colori per CPU dei dati di traccia, insieme all'elenco dettagliato degli eventi sottostante:

source: Once the appropriate license flags are on the white list in the :term:`LICENSE_FLAGS_ACCEPTED` variable, you can build the encumbered image with no change at all to the normal build process.
it_it: Una volta che i flag di licenza appropriati sono presenti nella whitelist della variabile :term:`LICENSE_FLAGS_ACCEPTED`, è possibile compilare l'immagine vincolata senza apportare alcuna modifica al normale processo di compilazione.

source: Once the build completes, you can find the ``.sh`` file that installs the tools in the ``tmp/deploy/sdk`` subdirectory of the :term:`Build Directory`. The installer file has the string "buildtools" or "buildtools-extended" in the name.
it_it: Una volta completata la compilazione, è possibile trovare il file ``.sh`` che installa gli strumenti nella sottocartella ``tmp/deploy/sdk`` della directory di :term:`Build Directory`. Il file di installazione ha la stringa "buildtools" o "buildtools-extended" nel nome.

source: Once the build process gets the sample file, it uses ``sed`` to substitute final ``${``\ :term:`OEROOT`\ ``}`` values for all ``##OEROOT##`` occurrences.
it_it: Una volta che il processo di build ottiene il file di esempio, utilizza ``sed`` per sostituire i valori finali di ``${``\ :term:`OEROOT`\ ``}`` per tutte le occorrenze di ``##OEROOT##``.

source: Once the build process gets the sample file, it uses ``sed`` to substitute final ``${``\ :term:`OEROOT`\ ``}`` values for all ``##OEROOT##`` values.
it_it: Una volta che il processo di compilazione riceve il file di esempio, utilizza ``sed`` per sostituire i valori finali ``${``\ :term:`OEROOT`\ ``}`` a tutti i valori ``##OEROOT##``.

source: Once the information has been updated, verify the new layer information is available by using the Toaster web interface. To do that, visit the "All compatible layers" page inside a Toaster project. The layers from your layer source should be listed there.
it_it: Una volta aggiornate le informazioni, verificare che le nuove informazioni sui layer siano disponibili utilizzando l'interfaccia web di Toaster. Per farlo, visitare la pagina "All compatible layers" all'interno di un progetto Toaster. I layer della propria sorgente di layer dovrebbero essere elencati lì.

source: Once these steps are complete and you have generated your patch files, you can run ``patchtest`` like so::
it_it: Una volta completati questi passaggi e generati i file delle patch, è possibile eseguire ``patchtest`` in questo modo::

source: Once these steps complete, Toaster is set up and ready to use.
it_it: Una volta completati questi passaggi, Toaster è configurato e pronto per l'uso.

source: Once we've done that, we can install the debugging information for BusyBox. The debug packages once built can be found in ``build/tmp/deploy/rpm/*`` on the host system. Find the ``busybox-dbg-...rpm`` file and copy it to the target. For example::
it_it: Una volta fatto ciò, possiamo installare le informazioni di debug per BusyBox. I pacchetti di debug, una volta creati, si troveranno in ``build/tmp/deploy/rpm/*`` sul sistema host. Individuare il file ``busybox-dbg-...rpm`` e copiarlo nel target. Ad esempio::

source: Once you complete the setup instructions for your machine, you need to get a copy of the ``bitbake-setup`` tool to set up the :term:`Poky` reference distribution on your :term:`build host`. Use the following commands to install the tool in a Python `virtual environment <https://docs.python.org/3/library/venv.html>`__:
it_it: Dopo aver completato le istruzioni di configurazione per la macchina, si deve ottenere una copia del tool ``bitbake-setup`` per configurare la distribuzione di riferimento di :term:`Poky` sul proprio :term:`build host`. Utilizzare i seguenti comandi per installare il tool in un `ambiente virtuale <https://docs.python.org/3/library/venv.html>`__ Python:

source: Once you file a bug, the bug is processed by the Yocto Project Bug Triage Team and further details concerning the bug are assigned (e.g. priority and owner). You are the "Submitter" of the bug and any further categorization, progress, or comments on the bug result in Bugzilla sending you an automated email concerning the particular change or progress to the bug.
it_it: Una volta segnalato un bug, questo verrà elaborato dallo Yocto Project Bug Triage Team, che assegnerà ulteriori dettagli (ad esempio, priorità e responsabile). Voi siete gli autori della segnalazione del bug e qualsiasi ulteriore categorizzazione, progresso o commento sul bug comporterà l'invio automatico di un'email da parte di Bugzilla in merito alla specifica modifica o allo stato di avanzamento della risoluzione del bug.

source: Once you have set up the Yocto Project and installed the Toaster system dependencies as described in the ":ref:`toaster-manual/start:Preparing to Use Toaster`" chapter, you are ready to start Toaster.
it_it: Dopo aver configurato Yocto Project e installato le dipendenze di sistema di Toaster come descritto nel capitolo ":ref:`toaster-manual/start:Preparing to Use Toaster`", è possibile avviare Toaster.

source: Once you have the input data, first you need to clone or fetch the latest CVE information from https://git.kernel.org:
it_it: Una volta ottenuti i dati di input, è necessario clonare o scaricare le informazioni CVE più recenti da https://git.kernel.org:

source: Once you've applied the above commits and built and booted your image (you need to build the ``core-image-sato-sdk`` image or use one of the other methods described in the ":ref:`profile-manual/intro:General Setup`" section), you're ready to start tracing.
it_it: Dopo aver applicato i commit sopra indicati e aver creato e avviato l'immagine (è necessario creare l'immagine ``core-image-sato-sdk`` o utilizzare uno degli altri metodi descritti nella sezione ":ref:`profile-manual/intro:General Setup`"), si è pronti per iniziare il tracing.

source: Once you've build the image on the host system, you're ready to boot it (or the equivalent pre-built image) and use ``crosstap`` to probe it (you need to source the environment as usual first)::
it_it: Una volta creata l'immagine sul sistema host, si è pronti per avviarla (o l'equivalente immagine precompilata) e utilizzare ``crosstap`` per analizzarla (prima si deve caricare l'ambiente come di consueto)::

source: Once you've done that, you can ``cd`` to whatever directory contains your scripts and use ``crosstap`` to run the script::
it_it: Dopodiché, ci si può spostare nella directory contenente gli script utilizzando il comando ``cd`` e usare ``crosstap`` per eseguire lo script::

source: Once you've done that, you should be able to run a SystemTap script on the target::
it_it: Una volta completata questa operazione, si dovrebbe essere in grado di eseguire uno script SystemTap sul target::

source: Once you've pressed the profile button, the three panes will fill up with profiling data:
it_it: Dopo aver premuto il pulsante profile, i tre riquadri si riempiranno con i dati di profilazione:

source: Once you've selected the device(s) you want to trace, selecting the ``blk`` tracer will turn the blk tracer on::
it_it: Una volta selezionati i dispositivi che si desidera tracciare, selezionando il tracer ``blk`` si attiverà il tracer blk::

source: Once your development host is set up to use the Yocto Project, there are several ways of working in the Yocto Project environment:
it_it: Una volta configurato il sistema host di sviluppo per utilizzare Yocto Project, esistono diversi modi per lavorare nell'ambiente di Yocto Project:

source: One approach to allowing tasks to perform root-only operations would be to require :term:`BitBake` to run as root. However, this method is cumbersome and has security issues. The approach that is actually used is to run tasks that benefit from root privileges in a "fake" root environment. Within this environment, the task and its child processes believe that they are running as the root user, and see an internally consistent view of the filesystem. As long as generating the final output (e.g. a package or an image) does not require root privileges, the fact that some earlier steps ran in a fake root environment does not cause problems.
it_it: Un approccio per consentire ai task di eseguire operazioni riservate all'utente root sarebbe quello di richiedere l'esecuzione di :term:`BitBake` come root. Tuttavia, questo metodo è macchinoso e presenta problemi di sicurezza. L'approccio effettivamente utilizzato consiste nell'eseguire i task che beneficiano dei privilegi di root in un ambiente root "fittizio". In questo ambiente, il task e i suoi processi figli credono di essere in esecuzione come utente root e vedono una visione internamente coerente del filesystem. Finché la generazione dell'output finale (ad esempio un pacchetto o un'immagine) non richiede privilegi di root, il fatto che alcuni passaggi precedenti siano stati eseguiti in un ambiente root fittizio non causa problemi.

source: One can amend an existing git commit message to add missing tags for contributors with the ``git commit --amend`` command.
it_it: È possibile modificare un messaggio di commit Git esistente per aggiungere i tag mancanti per i collaboratori con il comando ``git commit --amend``.

source: One especially important directory contained within the ``/sys/kernel/debug/tracing`` directory is the ``events`` subdirectory, which contains representations of every tracepoint in the system. Listing out the contents of the ``events`` subdirectory, we see mainly another set of subdirectories::
it_it: Una directory particolarmente importante all'interno della directory ``/sys/kernel/debug/tracing`` è la sottodirectory ``events``, che contiene la rappresentazione di ogni tracepoint del sistema. Elencando il contenuto della sottodirectory ``events``, vediamo principalmente un altro insieme di sottodirectory::

source: One of these actions allows us to show a view that displays a busybox-centric view of the profiled functions (in this case we've also expanded all the nodes using the ``E`` key):
it_it: Una di queste azioni ci permette di visualizzare una vista che mostra una panoramica delle funzioni profilate incentrata su BusyBox (in questo caso abbiamo anche espanso tutti i nodi usando il tasto ``E``):

source: One significant factor is that we value peer review. When a change is proposed to many of the core pieces of the project, it helps to have many eyes of review go over them. Whilst there is ultimately one maintainer who needs to make the final call on accepting or rejecting a patch, the review is made by many eyes and the exact people reviewing it are likely unknown to the maintainer. It is often the surprise reviewer that catches the most interesting issues!
it_it: Un fattore importante è che diamo valore alla revisione paritaria. Quando viene proposta una modifica a molti dei componenti principali del progetto, è utile che venga esaminata da più persone. Sebbene la decisione finale sull'accettazione o il rifiuto di una patch spetti a un singolo manutentore, la revisione viene effettuata da più persone e l'identità di chi la effettua è probabilmente sconosciuta al manutentore. Spesso è il revisore a sorpresa a individuare i problemi più interessanti!

source: One way around that is to put the following in a :term:`configuration file` when you build the image::
it_it: Un modo per aggirare il problema è inserire quanto segue in un :term:`configuration file` durante la creazione dell'immagine::

source: Online versions of the manual pages for the commands discussed in this section can be found here:
it_it: Le versioni online delle pagine di manuale per i comandi discussi in questa sezione sono disponibili qui:

source: Only a subset of these would be of interest to us when looking at this workload, so let's choose the most likely subsystems (identified by the string before the colon in the ``Tracepoint`` events) and do a ``perf stat`` run using only those subsystem wildcards::
it_it: Solo un sottoinsieme di questi sarebbe di nostro interesse quando esaminiamo questo carico di lavoro, quindi scegliamo i sottosistemi più probabili (identificati dalla stringa prima dei due punti negli eventi ``Tracepoint``) ed eseguiamo un ``perf stat`` utilizzando solo i caratteri jolly di questi sottosistemi::

source: Open Source Philosophy
it_it: Filosofia Open Source

source: Open source philosophy is characterized by software development directed by peer production and collaboration through an active community of developers. Contrast this to the more standard centralized development models used by commercial software companies where a finite set of developers produces a product for sale using a defined set of procedures that ultimately result in an end product whose architecture and source material are closed to the public.
it_it: La filosofia open source è caratterizzata da uno sviluppo software guidato dalla produzione e dalla collaborazione tra pari attraverso una comunità attiva di sviluppatori. Questo si contrappone ai modelli di sviluppo centralizzati più standard utilizzati dalle aziende di software commerciali, dove un insieme finito di sviluppatori produce un prodotto da vendere utilizzando una serie definita di procedure che in definitiva portano a un prodotto finale la cui architettura e il cui codice sorgente sono chiusi al pubblico.

source: Open source projects conceptually have differing concurrent agendas, approaches, and production. These facets of the development process can come from anyone in the public (community) who has a stake in the software project. The open source environment contains new copyright, licensing, domain, and consumer issues that differ from the more traditional development environment. In an open source environment, the end product, source material, and documentation are all available to the public at no cost.
it_it: I progetti open source hanno concettualmente diverse agende, approcci e processi di produzione concorrenti. Questi aspetti del processo di sviluppo possono provenire da chiunque nel pubblico (community) che abbia un interesse nel progetto software. L'ambiente open source presenta nuove problematiche relative a copyright, licenze, dominio e consumatori, che lo distinguono dagli ambienti di sviluppo più tradizionali. In un ambiente open source, il prodotto finale, il codice sorgente e la documentazione sono tutti disponibili al pubblico gratuitamente.

source: Open the Yocto Project implementation of :yocto_bugs:`Bugzilla <>`.
it_it: Aprire l'implementazioni di Yocto Project di :yocto_bugs:`Bugzilla <>`.

source: Open-Embedded Build System Components
it_it: Componenti di Open-Embedded Build System

source: OpenEmbedded Build System Concepts
it_it: Concetti del Sistema di Build OpenEmbedded

source: OpenEmbedded, a metadata set utilized by BitBake
it_it: OpenEmbedded, un set di metadati utilizzato da BitBake

source: OpenEmbedded-Core layers selftests
it_it: Auto-test dei layer di OpenEmbedded-Core

source: Opkg is intended for use on embedded Linux devices and is used in this capacity in the :oe_home:`OpenEmbedded <>` and `OpenWrt <https://openwrt.org/>`__ projects, as well as the Yocto Project.
it_it: Opkg è pensato per l'utilizzo su dispositivi Linux embedded e viene impiegato a tale scopo nei progetti :oe_home:`OpenEmbedded <>` e `OpenWrt <https://openwrt.org/>`__, nonché in Yocto Project.

source: Optimizing processes that are run across the image include ``mklibs`` and any other post-processing commands as defined by the :term:`ROOTFS_POSTPROCESS_COMMAND` variable. The ``mklibs`` process optimizes the size of the libraries.
it_it: I processi di ottimizzazione eseguiti sull'immagine includono ``mklibs`` e qualsiasi altro comando di post-elaborazione definito dalla variabile :term:`ROOTFS_POSTPROCESS_COMMAND`. Il processo ``mklibs`` ottimizza le dimensioni delle librerie.

source: Or add the following statement to a :term:`configuration file`::
it_it: Oppure aggiungere la seguente istruzione a un :term:`configuration file`::

source: Or build a non-SDK image but include the profiling tools (add ``tools-profile`` to the :term:`EXTRA_IMAGE_FEATURES` variable)::
it_it: Oppure si crea un'immagine senza SDK ma si include gli strumenti di profilazione (aggiungere ``tools-profile`` alla variabile :term:`EXTRA_IMAGE_FEATURES`)::

source: Or by editing your kernel configuration to include `DWARF4` debug information.
it_it: Oppure modificando la configurazione del kernel per includere le informazioni di debug di `DWARF4`.

source: Or if already checked out:
it_it: Oppure, se già presenti per un checkout:

source: Or if you have already cloned it, you need to pull the latest data:
it_it: Oppure, se è stato già clonato il repository, si devono scaricare i dati più recenti:

source: Or manually setting up the :term:`Layers <Layer>` (see :doc:`/dev-manual/poky-manual-setup`).
it_it: Oppure configurando manualmente i :term:`Layers <Layer>` (:doc:`/dev-manual/poky-manual-setup`).

source: Or provide a path to the :term:`Build Directory` when sourcing ``oe-init-build-env``. Any intermediate folders in the pathname must exist. This next example creates a :term:`Build Directory` named ``YP-6.1`` within the existing directory ``mybuilds``:
it_it: In alternativa, specifica il percorso della :term:`Build Directory` quando si esegue ``oe-init-build-env``. Tutte le cartelle intermedie nel path devono esistere. L'esempio seguente crea una :term:`Build Directory` denominata ``YP-6.1`` all'interno della directory esistente ``mybuilds``:

source: Ordering and :term:`BBFILE_PRIORITY` for the layers listed in :term:`BBLAYERS` matter. For example, if multiple layers define a machine configuration, the OpenEmbedded build system uses the last layer searched given similar layer priorities. The build system works from the top-down through the layers listed in :term:`BBLAYERS`.
it_it: L'ordine e il :term:`BBFILE_PRIORITY` per i layer elencati in :term:`BBLAYERS` sono importanti. Ad esempio, se più layer definiscono una configurazione macchina, il sistema di build OpenEmbedded utilizza l'ultimo layer cercato, a parità di priorità. Il sistema di build procede dall'alto verso il basso, attraverso i layer elencati in :term:`BBLAYERS`.

source: Originally, much of this testing was done manually. However, significant effort has been made to automate the tests so that more people can use them and the Yocto Project development team can run them faster and more efficiently.
it_it: In origine, gran parte di questi test veniva eseguita manualmente. Tuttavia, sono stati compiuti sforzi significativi per automatizzare i test in modo che più persone possano utilizzarli e il team di sviluppo di Yocto Project possa eseguirli più velocemente ed efficientemente.

source: Other layers may have similar testing branches but there is no formal requirement or standard for these so please check the documentation for the layers you are contributing to.
it_it: Altri layer possono avere branch di test simili, ma non esiste un requisito o uno standard formale in merito, quindi si deve di consultare la documentazione dei layer a cui si sta contribuendo.

source: Our :doc:`/migration-guides/index` detail how to migrate from one release of the Yocto Project to the next.
it_it: La nostra :doc:`/migration-guides/index` descrive in dettaglio come migrare da una release di Yocto Project alla successiva.
